[Killed] EqualityOperator
src/gilded_rose_refactored.mjs:16:11
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name == "Sulfuras, Hand of Ragnaros"){
+      if (this.items[i].name != "Sulfuras, Hand of Ragnaros"){
         continue;
       }
killedBy: Gilded Rose foo quality should foo with quality
statusReason: expected 1 to equal +0

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:16:11
 
   updateQuality() {
     for (var i = 0; i < this.items.length; i++) {
-      if (this.items[i].name == "Sulfuras, Hand of Ragnaros"){
+      if (true){
         continue;
       }
killedBy: Gilded Rose foo quality should foo with quality
statusReason: expected 1 to equal +0

[Killed] AssignmentOperator
src/gilded_rose_refactored.mjs:19:7
       if (this.items[i].name == "Sulfuras, Hand of Ragnaros"){
         continue;
       }
-      this.items[i].sellIn -= 1;
+      this.items[i].sellIn += 1;
       if (this.items[i].name == "Aged Brie"){
         if (this.items[i].sellIn < 0){
killedBy: Gilded Rose foo quality should foo with s-10 q10
statusReason: expected 9 to equal 8

[Killed] EqualityOperator
src/gilded_rose_refactored.mjs:20:11
         continue;
       }
       this.items[i].sellIn -= 1;
-      if (this.items[i].name == "Aged Brie"){
+      if (this.items[i].name != "Aged Brie"){
         if (this.items[i].sellIn < 0){
           this.items[i].quality += 2;
killedBy: Gilded Rose foo quality should foo
statusReason: expected 2 to equal +0

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:20:45
         continue;
       }
       this.items[i].sellIn -= 1;
-      if (this.items[i].name == "Aged Brie"){
-        if (this.items[i].sellIn < 0){
-          this.items[i].quality += 2;
-        } else {
-          this.items[i].quality += 1;
-        }
-      } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
+      if (this.items[i].name == "Aged Brie"){} else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
         if (this.items[i].sellIn < 1){
           this.items[i].quality = 0;
killedBy: Gilded Rose Aged Brie quality 0 0
statusReason: expected +0 to equal 2

[Killed] EqualityOperator
src/gilded_rose_refactored.mjs:21:13
       }
       this.items[i].sellIn -= 1;
       if (this.items[i].name == "Aged Brie"){
-        if (this.items[i].sellIn < 0){
+        if (this.items[i].sellIn >= 0){
           this.items[i].quality += 2;
         } else {
killedBy: Gilded Rose Aged Brie quality 0 0
statusReason: expected 1 to equal 2

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:21:13
       }
       this.items[i].sellIn -= 1;
       if (this.items[i].name == "Aged Brie"){
-        if (this.items[i].sellIn < 0){
+        if (false){
           this.items[i].quality += 2;
         } else {
killedBy: Gilded Rose Aged Brie quality 0 0
statusReason: expected 1 to equal 2

[Killed] AssignmentOperator
src/gilded_rose_refactored.mjs:22:11
       this.items[i].sellIn -= 1;
       if (this.items[i].name == "Aged Brie"){
         if (this.items[i].sellIn < 0){
-          this.items[i].quality += 2;
+          this.items[i].quality -= 2;
         } else {
           this.items[i].quality += 1;
killedBy: Gilded Rose Aged Brie quality 0 0
statusReason: expected +0 to equal 2

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:23:16
       if (this.items[i].name == "Aged Brie"){
         if (this.items[i].sellIn < 0){
           this.items[i].quality += 2;
-        } else {
-          this.items[i].quality += 1;
-        }
+        } else {}
       } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
         if (this.items[i].sellIn < 1){
killedBy: Gilded Rose Aged Brie quality 1 0
statusReason: expected +0 to equal 1

[Killed] AssignmentOperator
src/gilded_rose_refactored.mjs:24:11
         if (this.items[i].sellIn < 0){
           this.items[i].quality += 2;
         } else {
-          this.items[i].quality += 1;
+          this.items[i].quality -= 1;
         }
       } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
killedBy: Gilded Rose Aged Brie quality 1 0
statusReason: expected +0 to equal 1

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:26:18
         } else {
           this.items[i].quality += 1;
         }
-      } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
+      } else if (false){
         if (this.items[i].sellIn < 1){
           this.items[i].quality = 0;
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 11 0
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:26:84
         } else {
           this.items[i].quality += 1;
         }
-      } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
-        if (this.items[i].sellIn < 1){
-          this.items[i].quality = 0;
-        } else if (this.items[i].sellIn < 5){
-          this.items[i].quality += 3;
-        } else if (this.items[i].sellIn < 10){
-          this.items[i].quality += 2
-        } else {
-          this.items[i].quality += 1;
-        }
-      } else {
+      } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){} else {
         let multiplier = 1;
         if (this.items[i].name == "Conjured"){
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 11 0
statusReason: expected +0 to equal 1

[Killed] EqualityOperator
src/gilded_rose_refactored.mjs:27:13
           this.items[i].quality += 1;
         }
       } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
-        if (this.items[i].sellIn < 1){
+        if (this.items[i].sellIn <= 1){
           this.items[i].quality = 0;
         } else if (this.items[i].sellIn < 5){
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 2 0
statusReason: expected +0 to equal 3

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:27:13
           this.items[i].quality += 1;
         }
       } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
-        if (this.items[i].sellIn < 1){
+        if (true){
           this.items[i].quality = 0;
         } else if (this.items[i].sellIn < 5){
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 11 0
statusReason: expected +0 to equal 1

[Killed] EqualityOperator
src/gilded_rose_refactored.mjs:29:20
       } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
         if (this.items[i].sellIn < 1){
           this.items[i].quality = 0;
-        } else if (this.items[i].sellIn < 5){
+        } else if (this.items[i].sellIn <= 5){
           this.items[i].quality += 3;
         } else if (this.items[i].sellIn < 10){
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 6 0
statusReason: expected 3 to equal 2

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:29:20
       } else if (this.items[i].name == "Backstage passes to a TAFKAL80ETC concert"){
         if (this.items[i].sellIn < 1){
           this.items[i].quality = 0;
-        } else if (this.items[i].sellIn < 5){
+        } else if (false){
           this.items[i].quality += 3;
         } else if (this.items[i].sellIn < 10){
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 5 0
statusReason: expected 2 to equal 3

[Killed] AssignmentOperator
src/gilded_rose_refactored.mjs:30:11
         if (this.items[i].sellIn < 1){
           this.items[i].quality = 0;
         } else if (this.items[i].sellIn < 5){
-          this.items[i].quality += 3;
+          this.items[i].quality -= 3;
         } else if (this.items[i].sellIn < 10){
           this.items[i].quality += 2
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 5 0
statusReason: expected +0 to equal 3

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:31:20
           this.items[i].quality = 0;
         } else if (this.items[i].sellIn < 5){
           this.items[i].quality += 3;
-        } else if (this.items[i].sellIn < 10){
+        } else if (true){
           this.items[i].quality += 2
         } else {
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 11 0
statusReason: expected 2 to equal 1

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:31:46
           this.items[i].quality = 0;
         } else if (this.items[i].sellIn < 5){
           this.items[i].quality += 3;
-        } else if (this.items[i].sellIn < 10){
-          this.items[i].quality += 2
-        } else {
+        } else if (this.items[i].sellIn < 10){} else {
           this.items[i].quality += 1;
         }
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 10 0
statusReason: expected +0 to equal 2

[Killed] AssignmentOperator
src/gilded_rose_refactored.mjs:32:11
         } else if (this.items[i].sellIn < 5){
           this.items[i].quality += 3;
         } else if (this.items[i].sellIn < 10){
-          this.items[i].quality += 2
+          this.items[i].quality -= 2
         } else {
           this.items[i].quality += 1;
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 10 0
statusReason: expected +0 to equal 2

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:33:16
           this.items[i].quality += 3;
         } else if (this.items[i].sellIn < 10){
           this.items[i].quality += 2
-        } else {
-          this.items[i].quality += 1;
-        }
+        } else {}
       } else {
         let multiplier = 1;
killedBy: Gilded Rose Backstage passes to a TAFKAL80ETC concert quality 11 0
statusReason: expected +0 to equal 1

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:36:14
         } else {
           this.items[i].quality += 1;
         }
-      } else {
-        let multiplier = 1;
-        if (this.items[i].name == "Conjured"){
-          multiplier = 2;
-        }
-        if (this.items[i].sellIn < 0){
-          this.items[i].quality -= 2*multiplier;
-        } else {
-          this.items[i].quality -= 1*multiplier;
-        }
-      }
+      } else {}
       if (this.items[i].quality > 49){
         this.items[i].quality = 50;
killedBy: Gilded Rose foo quality should foo with quality
statusReason: expected 1 to equal +0

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:38:46
         }
       } else {
         let multiplier = 1;
-        if (this.items[i].name == "Conjured"){
-          multiplier = 2;
-        }
+        if (this.items[i].name == "Conjured"){}
         if (this.items[i].sellIn < 0){
           this.items[i].quality -= 2*multiplier;
killedBy: Gilded Rose Conjured quality should Conjured with s-1 q10
statusReason: expected 8 to equal 6

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:38:13
         }
       } else {
         let multiplier = 1;
-        if (this.items[i].name == "Conjured"){
+        if (true){
           multiplier = 2;
         }
killedBy: Gilded Rose foo quality should foo with s-10 q10
statusReason: expected 6 to equal 8

[Killed] ArithmeticOperator
src/gilded_rose_refactored.mjs:42:36
           multiplier = 2;
         }
         if (this.items[i].sellIn < 0){
-          this.items[i].quality -= 2*multiplier;
+          this.items[i].quality -= 2 / multiplier;
         } else {
           this.items[i].quality -= 1*multiplier;
killedBy: Gilded Rose Conjured quality should Conjured with quality
statusReason: expected 1 to equal +0

[Killed] AssignmentOperator
src/gilded_rose_refactored.mjs:42:11
           multiplier = 2;
         }
         if (this.items[i].sellIn < 0){
-          this.items[i].quality -= 2*multiplier;
+          this.items[i].quality += 2 * multiplier;
         } else {
           this.items[i].quality -= 1*multiplier;
killedBy: Gilded Rose foo quality should foo
statusReason: expected 2 to equal +0

[Killed] BlockStatement
src/gilded_rose_refactored.mjs:43:16
         }
         if (this.items[i].sellIn < 0){
           this.items[i].quality -= 2*multiplier;
-        } else {
-          this.items[i].quality -= 1*multiplier;
-        }
+        } else {}
       }
       if (this.items[i].quality > 49){
killedBy: Gilded Rose foo quality should foo with s1 q10
statusReason: expected 10 to equal 9

[Killed] AssignmentOperator
src/gilded_rose_refactored.mjs:44:11
         if (this.items[i].sellIn < 0){
           this.items[i].quality -= 2*multiplier;
         } else {
-          this.items[i].quality -= 1*multiplier;
+          this.items[i].quality += 1 * multiplier;
         }
       }
killedBy: Gilded Rose foo quality should foo with s1 q10
statusReason: expected 11 to equal 9

[Killed] ArithmeticOperator
src/gilded_rose_refactored.mjs:44:36
         if (this.items[i].sellIn < 0){
           this.items[i].quality -= 2*multiplier;
         } else {
-          this.items[i].quality -= 1*multiplier;
+          this.items[i].quality -= 1 / multiplier;
         }
       }
killedBy: Gilded Rose Conjured quality should Conjured with s1 q10
statusReason: expected 9.5 to equal 8

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:47:11
           this.items[i].quality -= 1*multiplier;
         }
       }
-      if (this.items[i].quality > 49){
+      if (true){
         this.items[i].quality = 50;
       } else if (this.items[i].quality < 1){
killedBy: Gilded Rose foo quality should foo
statusReason: expected 50 to equal +0

[Killed] EqualityOperator
src/gilded_rose_refactored.mjs:47:11
           this.items[i].quality -= 1*multiplier;
         }
       }
-      if (this.items[i].quality > 49){
+      if (this.items[i].quality <= 49){
         this.items[i].quality = 50;
       } else if (this.items[i].quality < 1){
killedBy: Gilded Rose foo quality should foo
statusReason: expected 50 to equal +0

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:49:18
       }
       if (this.items[i].quality > 49){
         this.items[i].quality = 50;
-      } else if (this.items[i].quality < 1){
+      } else if (true){
         this.items[i].quality = 0;
       }
killedBy: Gilded Rose foo quality should foo with s-10 q10
statusReason: expected +0 to equal 8

[Killed] ConditionalExpression
src/gilded_rose_refactored.mjs:49:18
       }
       if (this.items[i].quality > 49){
         this.items[i].quality = 50;
-      } else if (this.items[i].quality < 1){
+      } else if (false){
         this.items[i].quality = 0;
       }
killedBy: Gilded Rose foo quality should foo
statusReason: expected -2 to equal +0
